irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_crc_1539_IUT.c
  CS_CMM_PROBE_NODE_STMT(50,7,1) for(index = 0; CS_CMM_PROBE_NODE_EXPR(50,6,2)  index < BufferLength; CS_CMM_PROBE_NODE_EXPR(50,5,3)  index++)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable236,239) 
    
    CS_CMM_PROBE_NODE_STMT(50,4,4) ((CRC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x3000))->DR = pBuffer[index];
  } CS_CMM_PROBE_C1(240) CS_CMM_LABEL(cs_cmm_for_end_89_2) 
  
  CS_CMM_PROBE_NODE_STMT(50,3,5) 
   CODESCROLL_FUNC_END(89, 6, 118) return (((CRC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x3000))->DR);
} CODESCROLL_FUNC_END_RBRACE 






uint32_t CRC_GetCRC(void)
{ CODESCROLL_FUNC_BEGIN(90, (90, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable237,241) 
  
  CS_CMM_PROBE_NODE_STMT(50,2,0) 
  CS_CMM_PROBE_NODE_STMT(50,1,1) 
   CODESCROLL_FUNC_END(90, 6, 128) return (((CRC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x3000))->DR);
} CODESCROLL_FUNC_END_RBRACE 






void CRC_SetIDRegister(uint8_t IDValue)
{ CODESCROLL_FUNC_BEGIN(91, (91, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable238,242) 
  
  CS_CMM_PROBE_NODE_STMT(50,0,0) ((CRC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x3000))->IDR = IDValue;

CS_CMM_PROBE_NODE_STMT(51,7,1) 
 CODESCROLL_FUNC_END(91, 6, 139) } CODESCROLL_FUNC_END_RBRACE 






uint8_t CRC_GetIDRegister(void)
{ CODESCROLL_FUNC_BEGIN(92, (92, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable239,243) 
  
  CS_CMM_PROBE_NODE_STMT(51,6,0) 
  CS_CMM_PROBE_NODE_STMT(51,5,1) 
   CODESCROLL_FUNC_END(92, 6, 148) return (((CRC_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x3000))->IDR);
} CODESCROLL_FUNC_END_RBRACE 
